var screenField = {
    fAll: 0, 
   QN1_0_0:1,pQN1_0_0:2,QN1_0_1:3,pQN1_0_1:4,QN1_0_2:5,pQN1_0_2:6,QN1_0_3:7,pQN1_0_3:8,QN1_0_4:9,pQN1_0_4:10,
   QN1_1_0:11,pQN1_1_0:12,QN1_1_1:13,pQN1_1_1:14,QN1_1_2:15,pQN1_1_2:16,QN1_1_3:17,pQN1_1_3:18,QN1_1_4:19,pQN1_1_4:20,
   QN1_2_0:21,pQN1_2_0:22,QN1_2_1:23,pQN1_2_1:24,QN1_2_2:25,pQN1_2_2:26,QN1_2_3:27,pQN1_2_3:28,QN1_2_4:29,pQN1_2_4:30,
   QN1_3_0:31,pQN1_3_0:32,QN1_3_1:33,pQN1_3_1:34,QN1_3_2:35,pQN1_3_2:36,QN1_3_3:37,pQN1_3_3:38,QN1_3_4:39,pQN1_3_4:40,
   QN1_4_0:41,pQN1_4_0:42,QN1_4_1:43,pQN1_4_1:44,QN1_4_2:45,pQN1_4_2:46,QN1_4_3:47,pQN1_4_3:48,QN1_4_4:49,pQN1_4_4:50,
   QN1_5_0:51,pQN1_5_0:52,QN1_5_1:53,pQN1_5_1:54,QN1_5_2:55,pQN1_5_2:56,QN1_5_3:57,pQN1_5_3:58,QN1_5_4:59,pQN1_5_4:60,
   QN2_0_0:61,pQN2_0_0:62,QN2_0_1:63,pQN2_0_1:64,QN2_0_2:65,pQN2_0_2:66,QN2_0_3:67,pQN2_0_3:68,QN2_0_4:69,pQN2_0_4:70,
   QN2_1_0:71,pQN2_1_0:72,QN2_1_1:73,pQN2_1_1:74,QN2_1_2:75,pQN2_1_2:76,QN2_1_3:77,pQN2_1_3:78,QN2_1_4:79,pQN2_1_4:80,
   QN2_2_1_0:81,pQN2_2_1_0:82,QN2_2_1_1:83,pQN2_2_1_1:84,QN2_2_1_2:85,pQN2_2_1_2:86,QN2_2_1_3:87,pQN2_2_1_3:88,QN2_2_1_4:89,pQN2_2_1_4:90,
   QN2_2_2_0:91,pQN2_2_2_0:92,QN2_2_2_1:93,pQN2_2_2_1:94,QN2_2_2_2:95,pQN2_2_2_2:96,QN2_2_2_3:97,pQN2_2_2_3:98,QN2_2_2_4:99,pQN2_2_2_4:100,
   QN2_2_3_0:101,pQN2_2_3_0:102,QN2_2_3_1:103,pQN2_2_3_1:104,QN2_2_3_2:105,pQN2_2_3_2:106,QN2_2_3_3:107,pQN2_2_3_3:108,QN2_2_3_4:109,pQN2_2_3_4:110,
   QN2_2_4_0:111,pQN2_2_4_0:112,QN2_2_4_1:113,pQN2_2_4_1:114,QN2_2_4_2:115,pQN2_2_4_2:116,QN2_2_4_3:117,pQN2_2_4_3:118,QN2_2_4_4:119,pQN2_2_4_4:120,
   QN2_3_1_0:121,pQN2_3_1_0:122,QN2_3_1_1:123,pQN2_3_1_1:124,QN2_3_1_2:125,pQN2_3_1_2:126,QN2_3_1_3:127,pQN2_3_1_3:128,QN2_3_1_4:129,pQN2_3_1_4:130,
   QN2_3_2_0:131,pQN2_3_2_0:132,QN2_3_2_1:133,pQN2_3_2_1:134,QN2_3_2_2:135,pQN2_3_2_2:136,QN2_3_2_3:137,pQN2_3_2_3:138,QN2_3_2_4:139,pQN2_3_2_4:140,
   QN2_3_3_0:141,pQN2_3_3_0:142,QN2_3_3_1:143,pQN2_3_3_1:144,QN2_3_3_2:145,pQN2_3_3_2:146,QN2_3_3_3:147,pQN2_3_3_3:148,QN2_3_3_4:149,pQN2_3_3_4:150,
   QN2_3_4_0:151,pQN2_3_4_0:152,QN2_3_4_1:153,pQN2_3_4_1:154,QN2_3_4_2:155,pQN2_3_4_2:156,QN2_3_4_3:157,pQN2_3_4_3:158,QN2_3_4_4:159,pQN2_3_4_4:160,
   QN3_1_0:161,pQN3_1_0:162,QN3_1_1:163,pQN3_1_1:164,QN3_1_2:165,pQN3_1_2:166,QN3_1_3:167,pQN3_1_3:168,QN3_1_4:169,pQN3_1_4:170,
   QN4_1_0:171,pQN4_1_0:172,QN4_1_1:173,pQN4_1_1:174,QN4_1_2:175,pQN4_1_2:176,QN4_1_3:177,pQN4_1_3:178,QN4_1_4:179,pQN4_1_4:180,
   QN4_2_0:181,pQN4_2_0:182,QN4_2_1:183,pQN4_2_1:184,QN4_2_2:185,pQN4_2_2:186,QN4_2_3:187,pQN4_2_3:188,QN4_2_4:189,pQN4_2_4:190,
   //QN4_4_0: 211, pQN4_4_0: 212, QN4_4_1: 213, pQN4_4_1: 214, QN4_4_2: 215, pQN4_4_2: 216, QN4_4_3: 217, pQN4_4_3: 218, QN4_4_4: 219, pQN4_4_4: 220,
   CM3: 191,
   txt1_3_other: 192,
   rd1_3: 193,
   txtProjectCount: 194,
   txtProjectName: 195,
   txtAddress: 196,
   txtTel: 197,
   txtEmail: 198,
   QN4_3_0: 199, pQN4_3_0: 200, QN4_3_1: 201, pQN4_3_1: 202, QN4_3_2: 203, pQN4_3_2: 204, QN4_3_3: 205, pQN4_3_3: 206, QN4_3_4: 207, pQN4_3_4: 208,
   }; // last running is 208

function CalAllSatisfy() {
    Object.keys(screenField).forEach(function (a){
        if (a.substring(0,2) == "QN"){
            CalSastisfy({id:a})
        }
    }
    );
}
function CalSastisfy(val) {
    
    var i = appVueQN.items;
    var f = screenField;
    var all = i[f.fAll].v;
    var isZero = 0;
    if (all != null) {
        if (all == 0)
        {
            all = 1;
            isZero = 0;
        } else {
           
            isZero = 1;
        }

        i[eval("f.p" + val.id )].v = ((i[eval("f." + val.id )].v * 100 * isZero) / all).toFixed(2);
    } else {
        c2x.writeSummaryResult(null, 'กรุณาระบุจำนวนชุดที่สำรวจ');
    }
}
function SaveSatisfy() {
    let params = new URLSearchParams(location.search);
    let id = params.get("id");
    var saved = appVueQN.saveData();
    //console.log(saved);
   // c2x.writeSummaryResult('บันทึกสำเร็จ');
}